package by.htp.tasks.linear;
/*Дан прямоугольник, ширина которого в два раза меньше длины. 
 * Найти площадь прямоугольника */
public class LinearEx07 {

	public static void main(String[] args) {
		int a = 60;
		int b = a / 2;
		
		int c = a * b;
		
		System.out.println("Площадь прмоугольника равна " + c);
	}

}
