package by.htp.tasks.linear;
/*Написать код для решения задачи. В n малых бидонах 80 л молока. 
 * Сколько литров молока в m больших бидонах,
если в каждом большом бидоне на 12 л. больше, чем в малом? */
public class LinearEx06 {

	public static void main(String[] args) {
		int n = 80;
		int m = n + 12;
		
		System.out.println("В больших бидонах " + m + " литров молока");
	}

}
