package by.htp.tasks.conditions;
/* Составить программу сравнения двух чисел 1 и 2. 
 * Если 1 меньше 2 – вывести на экран слово «yes», в противном
случае – слово «no»
*/
public class ConditionsEx02 {

	public static void main(String[] args) {
		int a = 22;
		int b = 43;
		
		if (a < b) {
			System.out.println("yes");
		} else {
			System.out.println("no");
		}
	}

}
