package by.htp.tasks.conditions;
/* Составить программу сравнения двух чисел 1 и 2. 
 * Если 1 меньше 2 – вывести на экран цифру 7, в противном случае
– цифру 8.*/
public class ConditionsEx01 {

	public static void main(String[] args) {
		int a = 400;
		int b = 250;
		
		if (a < b) {
			System.out.println(7);
		} else {
			System.out.println(8);
		}
	}

}
